In [1]:
import pandas as pd

In [2]:
df1=pd.DataFrame({'a':[1,2,3],
                 "b":[10,20,30]})
df1

   a   b
0  1  10
1  2  20
2  3  30

In [14]:
df2=pd.DataFrame({'c':[4,5,6],
                 "d":[40,50,60]},index=['a','b','c'])
df2

   c   d
a  4  40
b  5  50
c  6  60

In [8]:
display(df1,df2)

   a   b
0  1  10
1  2  20
2  3  30

   c   d
0  4  40
1  5  50
2  6  60

In [9]:
df1.join(df2)

   a   b  c   d
0  1  10  4  40
1  2  20  5  50
2  3  30  6  60

In [10]:
df2.join(df1)

   c   d  a   b
0  4  40  1  10
1  5  50  2  20
2  6  60  3  30

In [11]:
df1.join(df2)

   a   b  c   d
0  1  10  4  40
1  2  20  5  50
2  3  30  6  60

In [12]:
df1=pd.DataFrame({'a':[1,2,3],
                 "b":[10,20,30]},index=['a','b','c'])

In [15]:
df1.join(df2)

   a   b  c   d
a  1  10  4  40
b  2  20  5  50
c  3  30  6  60

In [16]:
df2=pd.DataFrame({'c':[4,5],
                 "d":[40,50]},index=['a','b',])
df2

   c   d
a  4  40
b  5  50

In [17]:
df1.join(df2)

   a   b    c     d
a  1  10  4.0  40.0
b  2  20  5.0  50.0
c  3  30  NaN   NaN

In [18]:
df1.join(df2,how='right')

   a   b  c   d
a  1  10  4  40
b  2  20  5  50

In [19]:
df1.join(df2,how='inner')

   a   b  c   d
a  1  10  4  40
b  2  20  5  50

In [20]:
df1.join(df2,how='outer')

   a   b    c     d
a  1  10  4.0  40.0
b  2  20  5.0  50.0
c  3  30  NaN   NaN

In [21]:
df2=pd.DataFrame({'c':[4,5],
                 "b":[40,50]},index=['a','b',])
df2

   c   b
a  4  40
b  5  50

In [24]:
df1.join(df2,lsuffix='1')

   a  b1    c     b
a  1  10  4.0  40.0
b  2  20  5.0  50.0
c  3  30  NaN   NaN

In [25]:
df1.join(df2,rsuffix='1')

   a   b    c    b1
a  1  10  4.0  40.0
b  2  20  5.0  50.0
c  3  30  NaN   NaN